Revit 2024 API
FabricationServiceSettings.AirFluidType Property
 A special fluid type for fabrication HVAC services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ElementId AirFluidType { get; }
Visual Basic
Public Shared ReadOnly Property AirFluidType As ElementId
	Get
Visual C++
public:
static property ElementId^ AirFluidType {
	ElementId^ get ();
}
See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace